# Statistics

In [14]:
import pandas as pd
import numpy as np

In [16]:
df = pd.read_excel('weather_data_XL.xlsx')
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad             28          60     Sunny
1 2025-01-02    Hyderbad             29          62     Sunny
2 2025-01-03    Hyderbad             30          58    Cloudy
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [38]:
df['Temperature_C'].max()

34

In [40]:
df['Temperature_C'].min()

28

In [42]:
df['Temperature_C'].mean()

30.9

In [44]:
df['Temperature_C'].median()

31.0

In [46]:
df['Temperature_C'].mode()

0    29
1    31
2    32
Name: Temperature_C, dtype: int64

In [48]:
df['Temperature_C'].std()

1.911950719959998

In [50]:
df['Temperature_C'].var()

3.6555555555555554

In [52]:
df['Temperature_C'].describe()

count    10.000000
mean     30.900000
std       1.911951
min      28.000000
25%      29.250000
50%      31.000000
75%      32.000000
max      34.000000
Name: Temperature_C, dtype: float64

In [54]:
df[df.Temperature_C == df.Temperature_C.max()]

        Date      City  Temperature_C  Humidity_% Condition
6 2025-01-07  Banglore             34          61     Sunny

In [58]:
df.City[df.Temperature_C == df.Temperature_C.max() ]

6    Banglore
Name: City, dtype: object

In [60]:
df.count()

Date             10
City             10
Temperature_C    10
Humidity_%       10
Condition        10
dtype: int64

In [64]:
df["City"].nunique()

3

In [66]:
df["City"].value_counts()

City
Hyderbad      4
Banglore      4
Vijayawada    2
Name: count, dtype: int64

# String Cleaning

In [70]:
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad             28          60     Sunny
1 2025-01-02    Hyderbad             29          62     Sunny
2 2025-01-03    Hyderbad             30          58    Cloudy
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [76]:
df["City"] = df["City"].str.lower()
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    hyderbad             28          60     Sunny
1 2025-01-02    hyderbad             29          62     Sunny
2 2025-01-03    hyderbad             30          58    Cloudy
3 2025-01-04    hyderbad             31          55    Cloudy
4 2025-01-05    banglore             32          57     Rainy
5 2025-01-06    banglore             33          59     Rainy
6 2025-01-07    banglore             34          61     Sunny
7 2025-01-08    banglore             32          63    Cloudy
8 2025-01-09  vijayawada             31          64     Rainy
9 2025-01-10  vijayawada             29          62     Sunny

In [78]:
df["City"] = df["City"].str.upper()
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    HYDERBAD             28          60     Sunny
1 2025-01-02    HYDERBAD             29          62     Sunny
2 2025-01-03    HYDERBAD             30          58    Cloudy
3 2025-01-04    HYDERBAD             31          55    Cloudy
4 2025-01-05    BANGLORE             32          57     Rainy
5 2025-01-06    BANGLORE             33          59     Rainy
6 2025-01-07    BANGLORE             34          61     Sunny
7 2025-01-08    BANGLORE             32          63    Cloudy
8 2025-01-09  VIJAYAWADA             31          64     Rainy
9 2025-01-10  VIJAYAWADA             29          62     Sunny

In [80]:
df["City"] = df["City"].str.replace("HYDERBAD", "CHENNAI")
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01     CHENNAI             28          60     Sunny
1 2025-01-02     CHENNAI             29          62     Sunny
2 2025-01-03     CHENNAI             30          58    Cloudy
3 2025-01-04     CHENNAI             31          55    Cloudy
4 2025-01-05    BANGLORE             32          57     Rainy
5 2025-01-06    BANGLORE             33          59     Rainy
6 2025-01-07    BANGLORE             34          61     Sunny
7 2025-01-08    BANGLORE             32          63    Cloudy
8 2025-01-09  VIJAYAWADA             31          64     Rainy
9 2025-01-10  VIJAYAWADA             29          62     Sunny

# CONCATE DATA FRAMES

In [83]:
india_weather = pd.DataFrame({
    "City" : ["Mumbai","Banglore","Hyderbad"],
    "Temperature" : [32,45,35]
})
india_weather

       City  Temperature
0    Mumbai           32
1  Banglore           45
2  Hyderbad           35

In [85]:
US_weather = pd.DataFrame({
    "City" : ["New york","Chicago","orlando"],
    "Temperature" : [32,45,35]
})
US_weather

       City  Temperature
0  New york           32
1   Chicago           45
2   orlando           35

In [87]:
df = pd.concat([india_weather,US_weather])
df

       City  Temperature
0    Mumbai           32
1  Banglore           45
2  Hyderbad           35
0  New york           32
1   Chicago           45
2   orlando           35

In [89]:
df = pd.concat([india_weather,US_weather],ignore_index=True)
df

       City  Temperature
0    Mumbai           32
1  Banglore           45
2  Hyderbad           35
3  New york           32
4   Chicago           45
5   orlando           35

In [91]:
df = pd.concat([india_weather,US_weather],axis=1)
df

       City  Temperature      City  Temperature
0    Mumbai           32  New york           32
1  Banglore           45   Chicago           45
2  Hyderbad           35   orlando           35

# MERGE DATAFRAMES

In [94]:
temp_df = pd.DataFrame({
    "City" : ["Hyderbad","Vijayawada","Viskhapatnam","Chennai"],
    "Temperature" : [32,45,30,35]
})
temp_df

           City  Temperature
0      Hyderbad           32
1    Vijayawada           45
2  Viskhapatnam           30
3       Chennai           35

In [98]:
humidity_df = pd.DataFrame({
    "City" : ["Hyderbad","Vijayawada","Viskhapatnam","Bangalore"],
    "Humidity" : [62,65,60,75]
})
humidity_df

           City  Humidity
0      Hyderbad        62
1    Vijayawada        65
2  Viskhapatnam        60
3     Bangalore        75

In [100]:
df = pd.merge(temp_df,humidity_df,on="City")
df

           City  Temperature  Humidity
0      Hyderbad           32        62
1    Vijayawada           45        65
2  Viskhapatnam           30        60

In [104]:
df = pd.merge(temp_df,humidity_df,on="City",how="outer")
df

           City  Temperature  Humidity
0     Bangalore          NaN      75.0
1       Chennai         35.0       NaN
2      Hyderbad         32.0      62.0
3    Vijayawada         45.0      65.0
4  Viskhapatnam         30.0      60.0

In [106]:
df.isnull()

    City  Temperature  Humidity
0  False         True     False
1  False        False      True
2  False        False     False
3  False        False     False
4  False        False     False

In [108]:
df.isnull().sum()

City           0
Temperature    1
Humidity       1
dtype: int64

In [110]:
df['Temperature'] = df['Temperature'].fillna(df.Temperature.min())

In [112]:
df.isnull()

    City  Temperature  Humidity
0  False        False     False
1  False        False      True
2  False        False     False
3  False        False     False
4  False        False     False